13/data/attachments/b36fda8e7b291655.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d48cf0e5-4576-4905-a41c-0134eedbb505</nif:username>
            <nif:friendToBeAdded>Joseph_professional_Friend_64367_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>